run/secondary_breakup/secondaryBreakupBenz/secondaryBreakup_BaseCase/0_orig/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// ************************************************************************* //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    walls
    {
        type                zeroGradient;
    }
    
    inlet
    {
        type                zeroGradient;
    }
    
    outlet
    {
    	type zeroGradient;
    }

}


// ************************************************************************* //
