run/secondary_breakup/secondaryBreakupBenz/secondaryBreakup_BaseCase/0_orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    inlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
        outlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    

}


// ************************************************************************* //
