run/secondary_breakup/secondaryBreakupBenz/secondaryBreakup_BaseCase/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

// FOAMCHEMISTRY
chemistryReader	foamChemistryReader;
foamChemistryFile	"<constant>/species";
foamChemistryThermoFile "<constant>/thermo.species";




newFormat       yes;

inertSpecie     N2;

liquids
{
    Fe;
    H2O;
    Benz;
}

solids
{}


// ************************************************************************* //
