run/secondary_breakup/secondaryBreakupBenz/secondaryBreakup_BaseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001; // Scales to mm


vertices
(
// Bottom Circle
    (26 0 0) //0
    (0 26 0)//1
    (-26 0 0)//2
    (0 -26 0)//3
    
// Top circle
    (26 0 57) //4
    (0 26 57) //5
    (-26 0 57)//6
    (0 -26 57)//7
    

    
// Centre Points
    (0 0 0) //8
    (0 0 57)//9  

// Inlet
/*
    (4.7625 0 57) //10
    (0 4.7625 57)//11
    (-4.7625 0 57) //12
    (0 -4.7625 57)//13

    (4.7625 0 58) //14
    (0 4.7625 58)//15
    (-4.7625 0 58) //16
    (0 -4.7625 58)//17
    
    (0 0 58)//18
*/

);

blocks
(
    hex (0 1 8 8 4 5 9 9) (4 32 84) simpleGrading (1 1 1)
    hex (1 2 8 8 5 6 9 9) (4 32 84) simpleGrading (1 1 1)
    hex (2 3 8 8 6 7 9 9) (4 32 84) simpleGrading (1 1 1)
    hex (3 0 8 8 7 4 9 9) (4 32 84) simpleGrading (1 1 1)

    
);
edges
(
arc 0 1 (18.3847 18.3847 0) // (cx+rcos45 cy+rsin45 0 )
arc 1 2 (-18.3847 18.3847 0) 
arc 2 3 (-18.3847 -18.3847 0) 
arc 3 0 (18.3847 -18.3847 0) 

arc 4 5 (18.3847 18.3847 57)
arc 5 6 (-18.3847 18.3847 57)
arc 6 7 (-18.3847 -18.3847 57)
arc 7 4 (18.3847 -18.3847 57)

);


boundary
 (

  walls {
	  type wall;
	   faces (
	   /*
	  (0 8 8 1)
	  (1 8 8 2)
	  (2 8 8 3)
	  (3 8 8 0)
	  */
	  (4 9 9 5)
  	  (5 9 9 6)
  	  (7 9 9 6)
          (4 9 9 7)
          
          (0 1 4 5)
  	  (1 2 5 6)
  	  (2 3 7 6)
  	  (3 0 4 7)

    	  
	  );
  }
  
  outlet {
	  type wall;
	   faces (
	  (0 8 8 1)
	  (1 8 8 2)
	  (2 8 8 3)
	  (3 8 8 0)
	  /*
	  (4 9 9 5)
  	  (5 9 9 6)
  	  (7 9 9 6)
          (4 9 9 7)
          
          (0 1 4 5)
  	  (1 2 5 6)
  	  (2 3 7 6)
  	  (3 0 4 7)
  	  */

    	  
	  );
  }
  

);


/*
mergePatchPairs
()
;
*/
mergeType points;



// ************************************************************************* //
