run/secondary_breakup/secondaryBreakupBenz/secondaryBreakup_BaseCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     secondaryBreakupFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-4; //5e-3;

deltaT          5e-6; //2.5e-06;

writeControl    adjustable;

writeInterval   1e-05;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.1;

runTimeModifiable yes;

logLevel	4;

libs ("libmyThermophysicalProperties.so" "libmylagrangianSpray.so" "libmylagrangianIntermediate.so");

functions
{
/*
    distribution1
    {
        // Mandatory entries
        type            particleDistribution;
        libs            (fieldFunctionObjects);
        cloud           sprayCloud;
        nameVsBinWidth
        (
            (d 1e-5)
            (U 10)
        );
        setFormat       raw;

        // Optional entries
        tagField        none;

        // Optional (inherited) entries
        writePrecision  10;
        writeToFile     true;
        useUserTime     true;

        region          region0;
        enabled         true;
        log             true;
        timeStart       0;
        timeEnd         1000;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   -1;
    }
*/    
/*
    printyValue
    {
        type        writeObjects;
        //libs        (utilityFunctionObjects);
        //...
        objects     (banana);
        writeOption anyWrite;
    }
*/
}


// ************************************************************************* //
