run/secondary_breakup/secondaryBreakupBenz/secondaryBreakup_BaseCase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    //volScalarFieldValue N2 0.001
    //volScalarFieldValue Fe 0.001
);

regions
(
    faceToFace
    {
        set         injectorFaces;

        fieldValues
        (
            //volScalarFieldValue N2 1
            //volScalarFieldValue Fe 0.001
            volVectorFieldValue U (0 0 -80)
            /*(
            (
            0 0 -150)
            (
            0 0 -170
            )
            */
        );
       
        /*
        type            pressureInletOutletVelocity;
        inletValue      table
        (
            (0    (1 0 0))
            (5    (2 0 0))
            (10    (3 0 0))
        );
        */
    }
);


// ************************************************************************* //
